# У вас є текстовий файл, який містить інформацію про місячні заробітні плати розробників у вашій компанії. 
# Кожен рядок у файлі містить прізвище розробника та його заробітну плату, які розділені комою без пробілів.

# Наприклад:

# Alex Korp,3000
# Nikita Borisenko,2000
# Sitarama Raju,1000

# Ваше завдання - розробити функцію total_salary(path), яка аналізує цей файл і повертає загальну та середню суму 
# заробітної плати всіх розробників.



# Вимоги до завдання:

# Функція total_salary(path) має приймати один аргумент - шлях до текстового файлу (path).
# Файл містить дані про заробітні плати розробників, розділені комами. Кожен рядок вказує на одного розробника.
# Функція повинна аналізувати файл, обчислювати загальну та середню суму заробітної плати.
# Результатом роботи функції є кортеж із двох чисел: загальної суми зарплат і середньої заробітної плати.


# Рекомендації для виконання:

# Використовуйте менеджер контексту with для читання файлів.
# Пам'ятайте про встановлення кодування при відкриті файлів
# Для розділення даних у кожному рядку можна застосувати метод split(',').
# Обрахуйте загальну суму заробітної плати, а потім розділіть її на кількість розробників, щоб отримати середню зарплату.
# Опрацьовуйте можливі винятки при роботі з файлами, такі як відсутність файлу.


# Критерії оцінювання:

# Функція повинна точно обчислювати загальну та середню суми.
# Повинна бути обробка випадків, коли файл відсутній або пошкоджений.
# Код має бути чистим, добре структурованим і зрозумілим.


# Приклад використання функції:

# total, average = total_salary("path/to/salary_file.txt")
# print(f"Загальна сума заробітної плати: {total}, Середня заробітна плата: {average}")

# Очікуваний результат:

# Загальна сума заробітної плати: 6000, Середня заробітна плата: 2000


def total_salary(path):
    total = 0
    average = 0
    lines = 0
    try:
        with open(path, "r", encoding="utf-8", errors="strict") as fh:         
            while True:
                # перебираємо кожні лінію файлу
                line = fh.readline()
                if line:
                    lines +=1
                    # Знаходимо кому
                    find_point = line.find(',')
                    # робимо зріз по комі
                    salary_str = line[find_point+1:]
                    # перетворюємо строку в число і додаємо до загальної суми заробітної плати
                    total = total + int(salary_str)
                    # рахуємо середню заробітну плату
                    average = int(total / lines)
                else: 
                    break
            return total, average
    except:
        print("Файлу не знайдено або файл пошкоджено")
   

total, average = total_salary("task_1\salary_file.txt")
print(f"Загальна сума заробітної плати: {total}, Середня заробітна плата: {average}")